Tekla Open API Reference for Tekla Structures 2025
Polymesh.GetSolidBrep Method
 Gets the cleaned Brep
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool GetSolidBrep(
	FacetedBrep inBrep,
	out FacetedBrep outBrep
)
Public Shared Function GetSolidBrep (
	inBrep As FacetedBrep,
	<OutAttribute> ByRef outBrep As FacetedBrep
) As Boolean
Parameters
inBrep
Type: Tekla.Structures.Geometry3d.FacetedBrep
FacetedBrep to be cleaned
outBrep
Type: Tekla.Structures.Geometry3d.FacetedBrep
Cleaned facetedBrep
Return Value
Type: Boolean
True if Brep can create a valid solid, false if outBrep is nonsolid
See Also
Reference
Polymesh Class
Tekla.Structures.Model Namespace